#+TITLE: ft.ii.nz
#+PROPERTY: header-args:yaml+ :comments none

#+begin_quote
A FlatTrack instance for ii.nz
#+end_quote

** Install
#+begin_src shell
kubectl apply -f ./postgres-config.yaml
kubectl -n ft-ii-nz apply -f ./postgres.yaml
until kubectl -n ft-ii-nz wait --for=condition=ready pod --selector=app=postgres --timeout=90s 2>&1 > /dev/null; do
    sleep 1s;
done
sleep 3;
kubectl apply -f ./flattrack.yaml
#+end_src

#+RESULTS:
#+begin_example
secret/postgres-configuration configured
persistentvolumeclaim/postgres-pvc unchanged
statefulset.apps/postgres unchanged
service/postgres unchanged
helmrelease.helm.fluxcd.io/ft-ii-nz configured
#+end_example

